Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2064daa288.h
extern volatile __OFF047bits_t OFF047bits __asm__ ("OFF047") __attribute__((section("sfrs"), address(0xBF8105FC)));
#define OFF048 OFF048
extern volatile uint32_t   OFF048 __attribute__((section("sfrs"), address(0xBF810600)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF048bits_t;
extern volatile __OFF048bits_t OFF048bits __asm__ ("OFF048") __attribute__((section("sfrs"), address(0xBF810600)));
#define OFF049 OFF049
extern volatile uint32_t   OFF049 __attribute__((section("sfrs"), address(0xBF810604)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF049bits_t;
extern volatile __OFF049bits_t OFF049bits __asm__ ("OFF049") __attribute__((section("sfrs"), address(0xBF810604)));
#define OFF050 OFF050
extern volatile uint32_t   OFF050 __attribute__((section("sfrs"), address(0xBF810608)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF050bits_t;
extern volatile __OFF050bits_t OFF050bits __asm__ ("OFF050") __attribute__((section("sfrs"), address(0xBF810608)));
#define OFF051 OFF051
extern volatile uint32_t   OFF051 __attribute__((section("sfrs"), address(0xBF81060C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF051bits_t;
extern volatile __OFF051bits_t OFF051bits __asm__ ("OFF051") __attribute__((section("sfrs"), address(0xBF81060C)));
#define OFF052 OFF052
extern volatile uint32_t   OFF052 __attribute__((section("sfrs"), address(0xBF810610)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF052bits_t;
extern volatile __OFF052bits_t OFF052bits __asm__ ("OFF052") __attribute__((section("sfrs"), address(0xBF810610)));
#define OFF053 OFF053
extern volatile uint32_t   OFF053 __attribute__((section("sfrs"), address(0xBF810614)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF053bits_t;
extern volatile __OFF053bits_t OFF053bits __asm__ ("OFF053") __attribute__((section("sfrs"), address(0xBF810614)));
#define OFF054 OFF054
extern volatile uint32_t   OFF054 __attribute__((section("sfrs"), address(0xBF810618)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF054bits_t;
extern volatile __OFF054bits_t OFF054bits __asm__ ("OFF054") __attribute__((section("sfrs"), address(0xBF810618)));
#define OFF055 OFF055
extern volatile uint32_t   OFF055 __attribute__((section("sfrs"), address(0xBF81061C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF055bits_t;
extern volatile __OFF055bits_t OFF055bits __asm__ ("OFF055") __attribute__((section("sfrs"), address(0xBF81061C)));
#define OFF056 OFF056
extern volatile uint32_t   OFF056 __attribute__((section("sfrs"), address(0xBF810620)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF056bits_t;
extern volatile __OFF056bits_t OFF056bits __asm__ ("OFF056") __attribute__((section("sfrs"), address(0xBF810620)));
#define OFF057 OFF057
extern volatile uint32_t   OFF057 __attribute__((section("sfrs"), address(0xBF810624)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF057bits_t;
extern volatile __OFF057bits_t OFF057bits __asm__ ("OFF057") __attribute__((section("sfrs"), address(0xBF810624)));
#define OFF058 OFF058
extern volatile uint32_t   OFF058 __attribute__((section("sfrs"), address(0xBF810628)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF058bits_t;
extern volatile __OFF058bits_t OFF058bits __asm__ ("OFF058") __attribute__((section("sfrs"), address(0xBF810628)));
#define OFF059 OFF059
extern volatile uint32_t   OFF059 __attribute__((section("sfrs"), address(0xBF81062C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF059bits_t;
extern volatile __OFF059bits_t OFF059bits __asm__ ("OFF059") __attribute__((section("sfrs"), address(0xBF81062C)));
#define OFF060 OFF060
extern volatile uint32_t   OFF060 __attribute__((section("sfrs"), address(0xBF810630)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF060bits_t;
extern volatile __OFF060bits_t OFF060bits __asm__ ("OFF060") __attribute__((section("sfrs"), address(0xBF810630)));
#define OFF061 OFF061
extern volatile uint32_t   OFF061 __attribute__((section("sfrs"), address(0xBF810634)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF061bits_t;
extern volatile __OFF061bits_t OFF061bits __asm__ ("OFF061") __attribute__((section("sfrs"), address(0xBF810634)));
#define OFF062 OFF062
extern volatile uint32_t   OFF062 __attribute__((section("sfrs"), address(0xBF810638)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF062bits_t;
extern volatile __OFF062bits_t OFF062bits __asm__ ("OFF062") __attribute__((section("sfrs"), address(0xBF810638)));
#define OFF063 OFF063
extern volatile uint32_t   OFF063 __attribute__((section("sfrs"), address(0xBF81063C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF063bits_t;
extern volatile __OFF063bits_t OFF063bits __asm__ ("OFF063") __attribute__((section("sfrs"), address(0xBF81063C)));
#define OFF064 OFF064
extern volatile uint32_t   OFF064 __attribute__((section("sfrs"), address(0xBF810640)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF064bits_t;
extern volatile __OFF064bits_t OFF064bits __asm__ ("OFF064") __attribute__((section("sfrs"), address(0xBF810640)));
#define OFF065 OFF065
extern volatile uint32_t   OFF065 __attribute__((section("sfrs"), address(0xBF810644)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF065bits_t;
extern volatile __OFF065bits_t OFF065bits __asm__ ("OFF065") __attribute__((section("sfrs"), address(0xBF810644)));
#define OFF066 OFF066
extern volatile uint32_t   OFF066 __attribute__((section("sfrs"), address(0xBF810648)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF066bits_t;
extern volatile __OFF066bits_t OFF066bits __asm__ ("OFF066") __attribute__((section("sfrs"), address(0xBF810648)));
#define OFF067 OFF067
extern volatile uint32_t   OFF067 __attribute__((section("sfrs"), address(0xBF81064C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF067bits_t;
extern volatile __OFF067bits_t OFF067bits __asm__ ("OFF067") __attribute__((section("sfrs"), address(0xBF81064C)));
#define OFF068 OFF068
extern volatile uint32_t   OFF068 __attribute__((section("sfrs"), address(0xBF810650)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF068bits_t;
extern volatile __OFF068bits_t OFF068bits __asm__ ("OFF068") __attribute__((section("sfrs"), address(0xBF810650)));
#define OFF069 OFF069
extern volatile uint32_t   OFF069 __attribute__((section("sfrs"), address(0xBF810654)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF069bits_t;
extern volatile __OFF069bits_t OFF069bits __asm__ ("OFF069") __attribute__((section("sfrs"), address(0xBF810654)));
#define OFF070 OFF070
extern volatile uint32_t   OFF070 __attribute__((section("sfrs"), address(0xBF810658)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF070bits_t;
extern volatile __OFF070bits_t OFF070bits __asm__ ("OFF070") __attribute__((section("sfrs"), address(0xBF810658)));
#define OFF071 OFF071
extern volatile uint32_t   OFF071 __attribute__((section("sfrs"), address(0xBF81065C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF071bits_t;
extern volatile __OFF071bits_t OFF071bits __asm__ ("OFF071") __attribute__((section("sfrs"), address(0xBF81065C)));
#define OFF072 OFF072
extern volatile uint32_t   OFF072 __attribute__((section("sfrs"), address(0xBF810660)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF072bits_t;
extern volatile __OFF072bits_t OFF072bits __asm__ ("OFF072") __attribute__((section("sfrs"), address(0xBF810660)));
#define OFF073 OFF073
extern volatile uint32_t   OFF073 __attribute__((section("sfrs"), address(0xBF810664)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF073bits_t;
